app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "live_house_id", "content", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["live_house_id", 1], ["content", "いいお店です。"], ["score", 3], ["created_at", "2021-06-27 07:43:12.804568"], ["updated_at", "2021-06-27 07:43:12.804568"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    if @review.save