app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "6237357bd0133d6009cb6b71518a55f2c35b243dfe731727b1f471f28260"], ["updated_at", "2021-06-26 07:46:36.272568"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user = User.update(user_params)