app/models/live_house.rb

  def avg_score
    unless self.reviews.empty?
      reviews.average(:score).round(1).to_f
---
SELECT 1 AS one FROM "reviews" WHERE "reviews"."live_house_id" = ? LIMIT ?  [["live_house_id", 1], ["LIMIT", 1]]
SELECT AVG("reviews"."score") FROM "reviews" WHERE "reviews"."live_house_id" = ?  [["live_house_id", 1]]

  def review_score_percentage
    unless self.reviews.empty?
      reviews.average(:score).round(1).to_f*100/5
---
SELECT 1 AS one FROM "reviews" WHERE "reviews"."live_house_id" = ? LIMIT ?  [["live_house_id", 1], ["LIMIT", 1]]
SELECT AVG("reviews"."score") FROM "reviews" WHERE "reviews"."live_house_id" = ?  [["live_house_id", 1]]