app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."live_house_id" = ?  [["live_house_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."live_house_id" = ?  [["live_house_id", 1]]
---
              <div class="average-score-display ml-3 pt-2">
                <%= @live_house.avg_score %>点 （<%= @live_house.reviews.count %>件のレビュー）